using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Homew4
{
    class Program
    {
        static void Main(string[] args)
        {
            //Владислав Решко

            //5.
            //а) Написать программу, которая выводит на экран ваше имя, фамилию и город проживания.
            //б) Сделать задание, только вывод организовать в центре экрана.
            //в) *Сделать задание б с использованием собственных методов(например, Print(string ms, int x, int y).

            string a = "Владислав Решко";
            string b = "Харьков";


            Console.SetCursorPosition(50, 10);
            Console.WriteLine(a);

            Console.SetCursorPosition(50, 11);
            Console.WriteLine(b);
            //Не знаю как сделать в


        }
    }
}
